package org.example;

import java.util.ArrayList;

public class Storage {
        private ArrayList<String> quoteList;
        Storage() {
            quoteList = new ArrayList<>();
            quoteList.add("«Если Вы не видите на рынке дурака, то, наверное, это Вы сами».\n\nУоррен Баффет");
            quoteList.add("«Инвестирование должно напоминать наблюдение за тем, как сохнет краска или как растет трава. Если вам нужен азарт, то возьмите 800 долларов и поезжайте в Лас-Вегас».\n\nПол Самуэльсон");
            quoteList.add("«Рынок может оставаться иррациональным гораздо дольше времени, чем вы сможете оставаться платежеспособным».\n\nДжон Мейнард Кейнс");
            quoteList.add("«Если вам тяжело представить, что вы можете получить 20% убытков, торгуя на финансовых рынках, то вы не должны торговать вообще».\n\nДжон Богл");
            quoteList.add("«Инвестируйте в себя. Ваша карьера – это мотор вашего богатства».\n\nПол Клитероу");
            quoteList.add("«Самые успешные люди — это те, кто делают свое любимое дело».\n\nУоррен Баффет");
            quoteList.add("«Сколько вы знаете миллионеров, которые стали богаты, инвестируя в банковские депозиты? Вот то-то же».\n\nРоберт Аллен");
            quoteList.add("«Не ищите иголку в стогу сена. Просто купите весь стог сена целиком!».\n\nДжон Богл");
            quoteList.add("«Знайте, чем вы владеете, и знайте, почему вы этим владеете».\n\nПитер Линч");
            quoteList.add("«Я думаю, что всё, что заставляет людей думать, что они могут активно торговать акциями и делать это лучше, чем если бы они просто сидели в бумагах и ничего не делали — это ужасная ошибка».\n\nУоррен Баффет");
            quoteList.add("«Разумный инвестор – это реалист, который продает акции оптимистам и покупает у пессимистов».\n\nБенджамин Грэхэм");
            quoteList.add("«Инвестируйте на долгий срок. Просто не будьте слишком жадными и слишком пугливыми».\n\nШелби Дэвис");
            quoteList.add("«За каждой акцией стоит компания. Выясни, как у нее дела».\n\nПитер Линч");
            quoteList.add("«Финансовый рынок это устройство перераспределения денег от нетерпеливых инвесторов к терпливым».\n\nУорен Баффет");
            quoteList.add("«Наилучший способ измерить ваш инвестиционный успех заключается не в том, чтобы заработать больше рынка, а в том, чтобы иметь финансовый план и поведенческую дисциплину и следовать им. Именно они (план и дисциплина), наиболее вероятно, приведут вас туда, куда вы хотите».\n\nБенджамин Грэхэм ");
            quoteList.add("«Умение ждать важно для инвестора, но многие люди просто терпеть не могут ждать. Если вы не можете откладывать удовольствие на потом, вам придется очень много работать, чтобы преодолеть этот недостаток».\n\nЧарли Мангер");
            quoteList.add("«Многие люди с высоким IQ — ужасные инвесторы, потому что у них ужасный темперамент. Необходимо держать необузданные, иррациональные эмоции под контролем».\n\nЧарли Мангер");
            quoteList.add("«Инвесторы теряют гораздо больше денег на попытках предвидеть коррекции, чем на самих коррекциях».\n\nПитер Линч");
            quoteList.add("«Главная проблема инвестора, можно сказать, его злейший враг – это он сам. В конце концов, то, как ведут себя ваши инвестиции, гораздо менее важно, чем то, как ведете себя вы».\n\nБенджамин Грэхэм");
            quoteList.add("«Куда лучше купить замечательную компанию по честной цене, чем честную компанию по замечательной цене».\n\nУоррен Баффет");
            quoteList.add("«Самые большие деньги на фондовом рынке делаются в периоды спада. Просто в такие моменты люди этого не понимают».\n\nШэлби Дэвис");
            quoteList.add("«Индексный фонд фактически гарантирует вам превосходную доходность».\n\nУильям Бернстайн");
            quoteList.add("«Если человек не любит свою работу, а работает только ради денег, то он вряд ли сможет много заработать».\n\nЧарльз Шваб");
            quoteList.add("«Посадившие когда-то дерево сегодня сидят в его тени».\n\nУоррен Баффет");
            quoteList.add("«Больше занимайтесь тем, что приносит результат, и меньше тем, что не приносит».\n\nДэннис Гартмен");
            quoteList.add("«Нет ничего страшного, если вы не правы, но непростительно, если вы остаетесь в этом состоянии».\n\nМартин Цвейг");
            quoteList.add("«История дает ключевое представление о рыночных кризисах: они неизбежны, болезненны, но в конечном итоге преодолеваются».\n\nШелби Дэвис");
            quoteList.add("«Причина феноменального успеха ETF-ов в том, что они решили множество проблем, с которыми сталкивались инвесторы, а именно: прозрачность, ликвидность, затраты и налоговая эффективность».\n\nРоберт Капито");
            quoteList.add("«Как отмечает Грэхем, бесконтрольный оптимизм может превратиться в манию, а одним из главных признаков мании является забвение уроков истории».\n\nРоберт Хагстрем");
            quoteList.add("«Четыре самых опасных слова в инвестировании: “Все будет по другому” (на этот раз)».\n\nДжон Темплтон");
            quoteList.add("«Стоимость ценной бумаги определяется мнением людей».\n\nДжон Мейнард Кейнс");
            quoteList.add("«Инвесторы должны скептично относиться к моделям рынков и акций, основанных на исторических данных. Эти модели, построенные разными умниками, которые используют термины, понятные только «посвященным» (такие как бета, гамма, сигма и им подобные) – они могут произвести на вас большое впечатление. Однако довольно часто инвесторы забывают разобраться в предположениях, которые стоят за всеми этими моделями. Опасайтесь «ботаников» с формулами».\n\nУоррен Баффетт");
            quoteList.add("«В долгосрочной перспективе мы все мертвы».\n\nДжон Мейнард Кейнс");
            quoteList.add("«Фондовый рынок предсказал девять кризисов из последних пяти».\n\nПол Самюэльсон");
            quoteList.add("«Я расскажу вам, как стать богатым. Закройте двери. Бойтесь, когда другие жадны. Будьте жадны, когда другие боятся».\n\nУоррен Баффетт");
            quoteList.add("«Покупайте активы, когда льется кровь, и продавайте, когда звонят колокола».\n\nНатан Ротшильд ");
            quoteList.add("«Бычий рынок рождается на пессимизме, развивается на скептицизме, растет на оптимизме и умирает на эйфории».\n\nДжон Темплтон");
            quoteList.add("«Вкладывайте деньги в компанию с наименьшим количеством цветных фотографий в годовом отчете».\n\nПитер Линч");
            quoteList.add("«Я считаю, что те, кто продает акции и ждут более подходящего времени для выкупа этих же акций, редко достигают своей цели. Они обычно ждут, что снижение будет больше, чем кажется на самом деле»\n\nФиллип Фишер");
            quoteList.add("«Нам не нужно быть умнее остальных. Мы должны быть более дисциплинированы, чем остальные».\n\nУоррен Баффетт");
            quoteList.add("«Упорствуйте – не выбирайте “нет” в качестве ответа. Если вы счастливы, сидя на одном месте и не идя на риск, вы останетесь сидеть на этом же месте следующие 20 лет».\n\nДэвид Рубенштейн");
            quoteList.add("«Именно стремление объективно оценивать самих себя и окружающих сильнее всего отличает людей, использующих свой потенциал, от всех остальных».\n\nРэй Далио");
            quoteList.add("«Идея предчувствия является ключевой при инвестировании, а также в бизнесе вообще. Нельзя ждать, пока ситуация станет очевидной. Необходимо думать – вот что другие сделали при определенных обстоятельствах. Теперь же, при новых обстоятельствах, следует осознать, как поступать дальше?».\n\nЭдвард Ламперт");
            quoteList.add("«Если вы посмотрите на наши последние 15 решений, то увидите довольно посредственные достижения. Не было никакой гиперактивности, зато становится видно море терпения. Вам следует держаться своих принципов и возможностей, а когда появляется шанс, старайтесь максимально его использовать».\n\nЧарли Мунгер");
            quoteList.add("«Понимание того, на что не стоит обращать внимания, столь же важно, как понимание того, на чем следует сфокусироваться».\n\nУоррен Баффет");
            quoteList.add("«Индивидуальный инвестор должен действовать последовательно как инвестор и непоследовательно как спекулянт».\n\nБенджамин Грэхам");
            quoteList.add("«Для подавляющего большинства транзакций упрямство в отношении крошечной дробной разницы в цене может оказаться чрезвычайно дорогостоящим».\n\nФиллип Фишер");
            quoteList.add("«Когда вы покупаете акции, спрашивайте себя, купили бы вы всю компанию целиком?».\n\nРене Ривкин");
            quoteList.add("«Мой основной совет – не теряйте деньги».\n\nДжим Роджерс");
            quoteList.add("«Цель – найти 200 «лучших» компаний в мире и вложить в них деньги, потом найти 200 «худших» компаний в мире и уйти по ним «в короткую». Если 200 «лучших» не переплюнут 200 «худших», то вам лучше попробовать силы в другом бизнесе».\n\nДжулиан Робертсон");
            quoteList.add("«Фонд – не волшебная палочка – выручалочка, и он не обязательно сразу приносит прибыль, инвестор всегда должен быть готов выжидать рост после долгого периода потерь».\n\nДжон Богл");
            quoteList.add("«Мы диверсифицируем, поскольку не можем предсказать будущее».\n\nПол Самюэльсон");
            quoteList.add("«Тренировка не приводит к идеальным результатам, она приводит к стабильным результатам».\n\nУоррен Баффет");
            quoteList.add("«Вкладывайте деньги в ту компанию, в которую вложил бы любой дурак – именно потому, что рано или поздно какой-то дурак так и поступит».\n\nПитер Линч");
            quoteList.add("«Чем старше я становлюсь, тем лучше мне видно, куда идти. Если вы собираетесь охотиться на слонов, не надо сбиваться с пути ради кроликов».\n\nТомас Бун Пикенс");
        }

        String getRandQuote()
        {
            //получаем случайное значение в интервале от 0 до самого большого индекса
            int randValue = (int)(Math.random() * quoteList.size());
            //Из коллекции получаем цитату со случайным индексом и возвращаем ее
            return quoteList.get(randValue);
        }
}

